[
  {
    "id": "exp-1",
    "title": "Senior Software Engineer",
    "company": "Walmart Global Tech",
    "location": "Bangalore, India",
    "startDate": "2019-05",
    "endDate": null,
    "description": "Architect and maintain mission-critical backend services powering order fulfillment operations across supply chain and e-commerce platforms. Drive technical initiatives by leading cross-functional collaboration, solving complex system challenges, and delivering high-impact features that enhance business capabilities.",
    "achievements": [
      "Engineered highly scalable backend applications leveraging Java and Spring Boot frameworks, supporting enterprise-level transaction volumes",
      "Established technical mentorship programs for incoming engineers, significantly accelerating team onboarding and fostering knowledge transfer",
      "Implemented automated operational workflows and production-ready solutions that improved system reliability and minimized service disruptions",
      "Orchestrated complex technical problem-solving efforts and feature development across distributed teams, ensuring alignment and timely delivery"
    ],
    "technologies": ["Java", "Spring Boot", "Microservices", "AWS", "DevOps"]
  },
  {
    "id": "exp-2",
    "title": "Senior Software Engineer",
    "company": "Tracxn Technologies",
    "location": "Bangalore, India",
    "startDate": "2017-10",
    "endDate": "2019-05",
    "description": "Contributed to the Platform Engineering team by developing robust RESTful APIs and managing enterprise cloud infrastructure. Architected and maintained production-grade cloud environments with a focus on high availability, scalability, and operational excellence.",
    "achievements": [
      "Engineered Ansible-based automation pipelines for microservices deployment and lifecycle management, achieving a 40% reduction in manual operational overhead",
      "Developed automated tooling for Amazon Machine Image (AMI) generation, enabling rapid and consistent infrastructure scaling across environments",
      "Built an internal web-based management console that simplified staging and production environment operations, improving developer productivity",
      "Designed and maintained resilient cloud server infrastructure, ensuring optimal performance and reliability for production workloads"
    ],
    "technologies": ["Java", "RESTful APIs", "AWS", "Ansible", "Cloud Infrastructure", "Microservices"]
  },
  {
    "id": "exp-3",
    "title": "System Engineer",
    "company": "Tata Consultancy Services",
    "location": "Pune, India",
    "startDate": "2015-08",
    "endDate": "2017-10",
    "description": "Developed and enhanced enterprise-grade online banking applications, focusing on improving user experience, security posture, and business functionality. Implemented strategic features in digital loan processing workflows, optimizing customer engagement and operational efficiency.",
    "achievements": [
      "Modernized user interface architecture using AngularJS, resulting in improved navigation patterns and enhanced user interaction capabilities",
      "Integrated comprehensive web analytics solutions (Site Catalyst) to enable data-driven insights and measure customer engagement metrics",
      "Delivered new features for online loan application workflows, streamlining the customer journey and reducing processing friction",
      "Enhanced security and functionality of business banking web applications, contributing to improved user trust and platform reliability"
    ],
    "technologies": ["Java", "JSP", "Struts", "Spring Framework", "AngularJS", "Web Analytics"]
  }
]
